{"inkVersion":19,"root":[[{"->":"opening_1"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"opening_1":["^The Moon. The Earth. An iconic couple.","\n","^... or so they were. Even legendary romances can start to struggle after 4.5 billion years.","\n","^Earth was pretty focussed on itself. Moon was starting to feel neglected.","\n","^Moon decided it was time for a change. Moon left earth's orbit and set out on a new adventure...","\n","^Spiralling through the heavens and communing with the other celestials Moon heard about a special place where celestials can seek new love...","\n","^This is the Moonshot Café. It is perhaps the best café in the solar system.","\n","^Once a month they host a singles night especially for celestial bodies.","\n","^Will Moon find a new romance here?","\n","^Will this be the start of a wonderful new chapter, a new celestial alignment, an existential crisis for werewolves?","\n","^Let's find out!","\n",{"->":"introduction_splash"},{"#f":1}],"introduction_splash":["^introduction","\n",{"->":"guide_1"},{"#f":1}],"guide_1":["^Good evening planets, satellites and all other celestial bodies!  ",{"#":"{\"name\": \"fenrir\", \"mood\": \"neutral\"}"},"\n","^I'm Fenrir, owner of the Moonshot Café and your host for the evening. ",{"#":"{\"name\": \"fenrir\", \"mood\": \"neutral\"}"},"\n","^Tonight is my favourite night of the month. It's Singles Night! ",{"#":"{\"name\": \"fenrir\", \"mood\": \"joy\"}"},"\n","^I like to think of myself, indeed of my café, as a force majeure of matchmaking. I just love seeing you lovely celestials hitting it off. It sets my heart alight! ",{"#":"{\"name\": \"fenrir\", \"mood\": \"love\"}"},"\n","^More than a few stars have met their matches here. Some really big names. ",{"#":"{\"name\": \"fenrir\", \"mood\": \"neutral\"}"},"\n","^But I digress! Tonight isn't about them, or me. ",{"#":"{\"name\": \"fenrir\", \"mood\": \"neutral\"}"},"\n","^It's about you. I am here to help you find true love! ",{"#":"{\"name\": \"fenrir\", \"mood\": \"neutral\"}"},"\n","^But really it's down to you. ",{"#":"{\"name\": \"fenrir\", \"mood\": \"wink\"}"},"\n",{"->":"rules"},{"#f":1}],"rules":[["^Here's how this works. Pay close attention now! ",{"#":"{\"name\": \"fenrir\", \"mood\": \"listen\"}"},"\n","^There will be three speed dating rounds. You'll be paired with three celestials. You'll have a few minutes to chat to each one. ",{"#":"{\"name\": \"fenrir\", \"mood\": \"neutral\"}"},"\n","^At the end of the night you'll find out who you hit it off with. ",{"#":"{\"name\": \"fenrir\", \"mood\": \"neutral\"}"},"\n","^You can then choose one of those lucky celestial bodies to go on a date with! ",{"#":"{\"name\": \"fenrir\", \"mood\": \"joy\"}"},"\n","^Of course, you don't have to choose any of them if you don't want to. Single life is a beautiful thing. ",{"#":"{\"name\": \"fenrir\", \"mood\": \"wink\"}"},"\n","^Did you get all that? Or would you like me to explain the rules again? ",{"#":"{\"name\": \"fenrir\", \"mood\": \"listen\"}"},"\n","ev","str","^Explain the rules again","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^I'm ready to date!","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"rules"},{"#f":5}],"c-1":["\n",{"->":"guide_2"},{"#f":5}]}],{"#f":1}],"guide_2":["^Excellent! I'll take your orders, then we'll make a start. ",{"#":"{\"name\": \"fenrir\", \"mood\": \"neutral\"}"},"\n","^Good luck! ",{"#":"{\"name\": \"fenrir\", \"mood\": \"wink\"}"},"\n","end",{"#f":1}],"#f":1}],"listDefs":{}}